#include <bcm2835.h>
#include <stdio.h>
#include <signal.h>
#include <unistd.h>

#include<time.h>
#include <thread>
#include <mutex>
#include <atomic>

#include <sstream>
#include <iostream>
#include <iomanip>
#include <fstream>
#include <algorithm>
#include <vector>

#include <string.h>
#include <stdlib.h>
#include <cstdlib>

#include<errno.h> //errno
#include<sys/socket.h>
#include<netdb.h>
#include<ifaddrs.h>
#include<unistd.h>
#include<netinet/in.h>//INADDR_ANY
#include<arpa/inet.h>


//#include <ads1115.h>
//#include <wiringPi.h>

#include <inttypes.h>
#include <fcntl.h>
#include <linux/i2c-dev.h>
#include <sys/ioctl.h>

//#include <python2.7/Python.h>

#include <RH_RF95.h>


#include "ConfigFile.h"

#include <mosquitto.h>

using namespace std;

// SPI üzerinden RFM95 kullanımı için tanımlar...
#define BOARD_LORASPI

#define RF_CS_PIN  RPI_V2_GPIO_P1_24 // Slave Select on CE0 so P1 connector pin #24
#define RF_IRQ_PIN RPI_V2_GPIO_P1_22 // IRQ on GPIO25 so P1 connector pin #22
#define RF_RST_PIN RPI_V2_GPIO_P1_15 // RST on GPIO22 so P1 connector pin #15

#define NOT_FIN_PACKET true
#define FIN_PACKET false

#define MSG_INITIAL 0
#define MSG_PERIODICAL 1
#define MSG_WPS_LOST 2
#define MSG_VEHICLE_STATUS 3
#define MSG_INTERRIM 4

char TIMESTMP_COMPUTER[19];							// zaman damgası değişken tanımı

// ----------------------------------------------------------------------------------------------
// ------------------------                               ---------------------------------------
//							WPS LOST VARIABLES AND CLASSES
// ------------------------                               ---------------------------------------
// ----------------------------------------------------------------------------------------------
uint8_t NUMBER_OF_LOST_WPS;
uint8_t DETECTED_WPS = 0;
int WPSSignalSending = 0; // Paket yollayan WPS sayısı
						  //uint8_t WPSRegistered = 0; // registered WPS dosyasından okunan WPS sayısı
unsigned long LostCheckTimer = 0;		// lost wps için timeout sayacı. olarak çalışıyor.
										//uint8_t WPS_ID_CORRECTED = 0; //COORDINATOR ADRESINE GÖRE DÜZELTİLMİŞ WPS ID ...LOST CHECK İŞLEMİ İÇİN


/////////////////////////////////////////////////////////////////////////
//							NEW DEFINITIONS 
/////////////////////////////////////////////////////////////////////////

#pragma pack(1)
struct sWPSData
{
	// DYNAMIC VALUES (Bytes 00-15)
	uint8_t nw_id;
	uint8_t flagtype;
	uint8_t sequence3;
	uint8_t sequence2;
	uint8_t sequence1;
	uint16_t temp;
	uint16_t voltage;
	uint8_t rssi;
	uint8_t error_vehicle;
	uint8_t retry_variance;
	float vector;

	// STATIC VALUES (Bytes 16-30)
	uint16_t versions;
	uint32_t serialble;
	uint16_t serialmsb;
	uint8_t mag_varordiff;
	uint8_t varlimits;
	uint8_t rssilimits;
	uint8_t blepw_radiopw_chkrssi;
	uint8_t vehicledc_sleepc;
	uint8_t lorachannel;
	uint8_t diffmultp_bleto_gain;
	uint8_t checksum;

	/*
	// LOST CHECK VARIABLES
	bool IsLost;
	bool WasLost;
	bool OnRegisteredWPSFile;
	bool SignalSending;
	uint64_t WPSSerial;
	unsigned long LostTimer;
	*/
}wpsdata;
#pragma pack()

#pragma pack(1)
struct sLostStruct
{
	// LOST CHECK VARIABLES
	bool IsLost;
	bool WasLost;
	bool OnRegisteredWPSFile;
	bool SignalSending;
	uint64_t WPSSerial;
	unsigned long LostTimer;
};
#pragma pack()

#pragma pack(1)
struct sCoordData
{
	// DYNAMIC VALUES (Bytes 00-03)
	uint8_t nw_id;
	uint8_t flagtype;
	uint8_t rssi;
	uint8_t changerq;
	uint8_t changeflag;
	// CHANGE PARAMETERS (Bytes 16-30)
	uint8_t mag_varordiff;
	uint8_t varlimits;
	uint8_t rssilimits;
	uint8_t blepw_radiopw_chkrssi;
	uint8_t vehicledc_sleepc;
	uint8_t lorachannel;
	uint8_t diffmultp_bleto_gain;
	uint8_t wpsaddress;
}coordinatordata;
#pragma pack()

#pragma pack(1)
struct sCoordinator_Config
{
	float frq;
	uint8_t registered_wps;
	uint8_t lost_wps_count; // LOST WPS SENSOR COUNT için initial değer....
	uint8_t max_wps;
	uint8_t address;
	uint8_t NW_id;
	uint8_t HWversion;
	uint8_t SWversion_Minor;
	uint8_t SWversion_Major;
	uint32_t serial;
	uint16_t secret;
	char ServerAddress[256];
	uint16_t ServerPort;
	uint8_t power;
	uint8_t wps_lost_cycle; //NUMBER OF TRANSMISION CYCLES TO ASSUME WPS LOST
	char mqtt_username[40];
	char mqtt_password[40];
	char mqtt_topic[40];
	uint32_t IPaddress;
};
#pragma pack()
sCoordinator_Config coordinator;


//////////////////////////////////////////////////////
//                  MQTT STRUCTS
//////////////////////////////////////////////////////
#pragma pack(1)
struct sMQTTPreamble
{
	//11 bytes
	uint8_t	MessageType;
	uint32_t Serial;
	// COORDINATOR TIME
	uint8_t Year;
	uint8_t Month;
	uint8_t Day;
	uint8_t Hour;
	uint8_t Min;
	uint8_t Sec;
}preamble;
#pragma pack()

#pragma pack(1)
struct sMQTTCoordinatorHealth
{
	//12 bytes
	float Voltage;
	float Temp;
	float Hum;
}coordhealth;
#pragma pack()

#pragma pack(1)
struct sMQTTCoordinatorConfig
{
	//15 bytes
	uint8_t Address;				// 09 - COORDINATOR_ADDRESS
	uint8_t NW_id;					// 10 - NETWORK ID
	uint8_t HWversion;				// 11 - HW_VERSION
	uint8_t SWversion_Major;			// 12 - SW_VERSION MAJOR
	uint8_t SWversion_Minor;			// 13 - SW_VERSION MINOR
	uint8_t Radiopower;					// 14 - RADIO POWER
	uint8_t max_wps;					// 15 - MAX WPS
	uint8_t wps_lost_cycle;			// 16 - WPS LOST CYCLE
	uint8_t LORAChannel;

	uint8_t lost_wps_count;			// 21 - LOST WPS COUNT
	uint8_t registered_wps;			// 22 - REGISTERED WPS COUNT
	uint32_t IPaddress;
};
#pragma pack()

#pragma pack(1)
struct sMQTTWPSinterrim
{
	// 19 Bytes
	uint8_t nw_id;
	uint32_t sequence;
	uint16_t temp;
	uint16_t voltage;
	uint8_t rssi;
	uint8_t error;
	uint8_t vehicle;
	uint8_t retrycount;
	uint8_t variance;
	float vector;
	uint8_t coordrssi;
};
#pragma pack()

#pragma pack(1)
struct sMQTTWPScfg
{
	// 28 bytes
	uint8_t hwvers;
	uint8_t swvermaj;
	uint8_t swvermin;
	uint64_t serial;
	uint8_t magomxy;
	uint8_t magomz;
	uint8_t magfrq;
	uint8_t maggain;
	uint8_t varordiff;
	uint8_t varlimit;
	uint8_t varbase;

	uint8_t rssilimit;
	uint8_t rssibase;
	uint8_t blepw;
	uint8_t radiopw;
	uint8_t chkrssi;
	uint8_t vehicledc;
	uint8_t sleepc;
	uint8_t lorachannel;
	uint8_t diffmultp;
	uint8_t bleto;

};
#pragma pack()

#pragma pack(1)
struct sMQTTinitial
{
	sMQTTPreamble preamble; //11 bytes
	sMQTTCoordinatorHealth coordhealth; //12 bytes
	//sMQTTCoordinatorConfig coordcfg; //15 bytes
